2003=morrison=esther=free__biography.org
#+title:      Esther Josephine Morrison nee Free, 1910-2003
#+date:       [2026-03-16 Mon 14:55]
#+SUBTITLE: Something to call my own
#+Author: George Morrison Jones
#+signature:  2003=morrison=esther=free
#+email: gmj@pobox.com
#+filetags:   :biography:public:
#+identifier: 20240226T063622
#+BIBLIOGRAPHY: family.bib
#+cite_export: csl chicago-fullnote-bibliography.csl
#+OPTIONS: author:t date:t 
#+OPTIONS: html-postamble:nil
#+LATEX_COMPILER: pdflatex
#+LATEX_HEADER: \usepackage{pmboxdraw}
#+LATEX_HEADER: \usepackage{titling}
#+LATEX_HEADER: \preauthor{\begin{center}\large}
#+LATEX_HEADER: \postauthor{\par\normalsize gmj@pobox.com\end{center}}
#+OPTIONS: email:nil
#+latex_class: article
#+latex_class_options: [titlepage]
#+MACRO: conditional-title (eval (if (org-export-derived-backend-p org-export-current-backend 'latex) "#+OPTIONS: title:t" "#+OPTIONS: title:nil"))
{{{conditional-title}}}
#+last_saved: 2026-03-16 15:11


This is my attempt to record "oral history", things I have been told,
things I remember (or mis-remember).  It is largely not fact-checked
(dates, names, etc.).

* Esther Josephine Morrison née Free
** A small kindness in a big family long remembered
When Grandma died, she still had a little doll-bed that one of her
brothers had made for her out of a few scraps of wood and some nails.

  #   Large family, not rich, limited options for women
  # + have a unique story to tell.
  #   childhood, 7 siblings, school, marriage, 2nd life in worthington

She was born in 1910 in a small house outside of Jeffersonville,
Ohio. She was one
of the middle children of what would be a family of 11 kids.  When she
was born, her father's whereabouts where unknown.  This always stuck
with her.  Shortly after that, they moved two a two room house near
Austin, Ohio to (I'm guessing) be near her uncle Omar Free who had
a farm and appears to have been somewhat more well off (there were
stories of rides in his car c.a. 1920).  I think Grandma was named for
his wife "Hester".

Her father was back in the picture, and they added rooms to the small
house, but growing up like that, there was very little you could call your own.
That doll bed, and the act of kindness that it represented, were apparently
precious to her.

** Hard work at home and school
To hear her tell it, her mother favored the boys. As her older sisters
(Nellie, Bess) got married, more of the job of helping her mother fell
to her. She went to the brick one-room school house down the road and
later Frankfort High School. She worked hard and excelled, becoming
class valedictorian. Hard work and doing well at school where something
she could call her own. Towards the end of her life, we visited the
high school, soon to be torn down, and as we drove away I heard her
softly singing the alma matter to herself. Those were her glory days.

She was always driven to work hard, to do the right thing, and to do
it well, which in her life meant a lot of housework, caring for family,
and jobs caring for others. To go slightly Freudian, I think she never
stopped trying to prove herself to a mother and father who never provided
the affirmation she sought (possibly because they were just trying
to keep food on the table).

Her brother Luther, next older, died when Grandma was very young.  She
thought he was hiding and went looking for him behind doors.

One of her best friends growing up was Laura Crago.  In the it's a
small world department we're almost certain she was related to Steph's
adoptive grandmother Mary Benson nee Crago.  I recently found out
Laura's maiden name was Free, so probably a cousin of some sort, by marriage?

** Morrisons, Marriage and Mother-in-Law
She worked for the Morrison after (during ?) high school, as my great
grandmother moved into her 80s. Irnie's wife Ada (Rinkliff)
[13-DEC-1893 to 16-OCT-1920] had died in childbirth,
so the household was my great grandmother, Grandpa (43) and
his older brother Irnie. Note, that had Ada not died, it's likely they
would not have needed domestic help 9 years later, and this narrative
would never have happened. Life.

Gradma began as a freshman at Willmington College in the fall of 1929.
In October, Grandpa drove there, picked her up and they went to Maysville,
KY and got married where the age of consent was lower. She was 19,
he was 43. Early letters to her sisters were signed "Mrs. George L.
Morrison", perhaps the custom of the time, but perhaps still seeking
something to call her own (identity, social status)

When I asked her about why they got married her answer was "It seemed
like the thing to do."  She was also afraid that she would not be able
to maintain her own high standards with college level work.  And one
alternative seemed to be returning home, which (inferring) was a
situation she desperately wanted out of.

Of course once married, she picked up where she left off with domestic
chores and caring for a mother-in-law who I infer was very proud in
her own ways and (guessing) maybe not thrilled with the marriage of
her son.

My great-grandmother had a cookbook/housekeeping guide that was
dedicated to "The Pert Housewives of 1876" and contained a section on
dealing with "the help" which consisted mostly in deriding "girls"
(sic) as flighty, un-reliable, a bad influence and lazy.  That was NOT
Grandma.  But it may have influenced her reception.

The story goes that one time Grandma was (obsessively I'm sure) cleaning
the basement stairs in a dirty dug-out cellar under the house that
was likely was impossible to keep clean, and my great grandmother
said "Pa would never let me do that". Ouch. Still no approval.

** "In a Kingdom By The Sea..."
Poetry was a lifelong love. Philip (1933) was named Philip Lee, after
Poe's Anabell Lee. Mom (1936) was named Elaine, after Tennyson's "Elaine
the lovable, Elaine the fair, Elaine the lily maid of Astalot." You
could find solace in poetry, you could connect with worlds far away,
with noble thoughts, tragedies and triumphs, and you didn't need anyone's
approval.

She often recounted a story to me that someone once asked in an offhand
way "What is life?", to which she replied (with gleam in her eye) by
quoting (our "cousin Henry") Longfellow's "A Psalm of Life".

#+begin_quote
Tell me not in mournful numbers,
'life is but an empty dream',
for the soul is dead that slumbers,
and things are not what they may seem,

Life is real, life is earnest,
and the grave is not it's goal,
dust thou art, to dust returneth,
'twas not spoken of the soul"

...
#+end_quote

I've memorized that one too. She probably had hundreds memorized, at
least in part. I have a poetry book in which she marked her favorites:
"The Pert Chicken", "The Dash", "The Mighty Casey", "The Midnight Ride
of Paul Revere", "'Ya Gotta Get a Glory (in the work you do)"....

