2003=morrison=esther=free__biography.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-03-16 Mon 14:55 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Esther Josephine Morrison nee Free</title>
<meta name="author" content="George Morrison Jones" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="preamble" class="status">
<h1 class="title">Esther Josephine Morrison nee Free</h1>
          <p class="subtitle">"Something to call my own"</p>
          <br>
          <p class="subtitle">George Morrison Jones</p>
          <p class="subtitle"><a href="mailto:gmj@pobox.com">gmj@pobox.com</a></p>
          <p class="subtitle">2026-03-16 Mon 14:55</p>
</div>
<div id="content" class="content">
<h1 class="title">Esther Josephine Morrison nee Free
<br />
<span class="subtitle">"Something to call my own"</span>
</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org59f9c9f">1. Esther Josephine Morrison née Free</a>
<ul>
<li><a href="#orgcf86c1a">1.1. A small kindness in a big family long remembered</a></li>
<li><a href="#org1ac53c3">1.2. Hard work at home and school</a></li>
<li><a href="#org8db75b1">1.3. Morrisons, Marriage and Mother-in-Law</a></li>
<li><a href="#orgc0e8dcc">1.4. "In a Kingdom By The Sea&#x2026;"</a></li>
<li><a href="#org67aac36">1.5. Raising Kids in Hard Times</a></li>
<li><a href="#orgd5cb698">1.6. "I wonder how the old folks are at home&#x2026;"</a></li>
<li><a href="#orgec7cc17">1.7. Gee !!!, a second family.</a></li>
<li><a href="#org004e0d3">1.8. 1990s and 90</a></li>
</ul>
</li>
<li><a href="#org3a7909c">2. Timeline</a></li>
</ul>
</div>
</div>
<p>
This is my attempt to record "oral history", things I have been told,
things I remember (or mis-remember).  It is largely not fact-checked
(dates, names, etc.).
</p>
<div id="outline-container-org59f9c9f" class="outline-2">
<h2 id="org59f9c9f"><span class="section-number-2">1.</span> Esther Josephine Morrison née Free</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgcf86c1a" class="outline-3">
<h3 id="orgcf86c1a"><span class="section-number-3">1.1.</span> A small kindness in a big family long remembered</h3>
<div class="outline-text-3" id="text-1-1">
<p>
When Grandma died, she still had a little doll-bed that one of her
brothers had made for her out of a few scraps of wood and some nails.
</p>

<p>
She was born in 1910 in a small house outside of Jeffersonville,
Ohio. She was one
of the middle children of what would be a family of 11 kids.  When she
was born, her father's whereabouts where unknown.  This always stuck
with her.  Shortly after that, they moved two a two room house near
Austin, Ohio to (I'm guessing) be near her uncle Omar Free who had
a farm and appears to have been somewhat more well off (there were
stories of rides in his car c.a. 1920).  I think Grandma was named for
his wife "Hester".
</p>

<p>
Her father was back in the picture, and they added rooms to the small
house, but growing up like that, there was very little you could call your own.
That doll bed, and the act of kindness that it represented, were apparently
precious to her.
</p>
</div>
</div>
<div id="outline-container-org1ac53c3" class="outline-3">
<h3 id="org1ac53c3"><span class="section-number-3">1.2.</span> Hard work at home and school</h3>
<div class="outline-text-3" id="text-1-2">
<p>
To hear her tell it, her mother favored the boys. As her older sisters
(Nellie, Bess) got married, more of the job of helping her mother fell
to her. She went to the brick one-room school house down the road and
later Frankfort High School. She worked hard and excelled, becoming
class valedictorian. Hard work and doing well at school where something
she could call her own. Towards the end of her life, we visited the
high school, soon to be torn down, and as we drove away I heard her
softly singing the alma matter to herself. Those were her glory days.
</p>

<p>
She was always driven to work hard, to do the right thing, and to do
it well, which in her life meant a lot of housework, caring for family,
and jobs caring for others. To go slightly Freudian, I think she never
stopped trying to prove herself to a mother and father who never provided
the affirmation she sought (possibly because they were just trying
to keep food on the table).
</p>

<p>
Her brother Luther, next older, died when Grandma was very young.  She
thought he was hiding and went looking for him behind doors.
</p>

<p>
One of her best friends growing up was Laura Crago.  In the it's a
small world department we're almost certain she was related to Steph's
adoptive grandmother Mary Benson nee Crago.  I recently found out
Laura's maiden name was Free, so probably a cousin of some sort, by marriage?
</p>
</div>
</div>
<div id="outline-container-org8db75b1" class="outline-3">
<h3 id="org8db75b1"><span class="section-number-3">1.3.</span> Morrisons, Marriage and Mother-in-Law</h3>
<div class="outline-text-3" id="text-1-3">
<p>
She worked for the Morrison after (during ?) high school, as my great
grandmother moved into her 80s. Irnie's wife Ada (Rinkliff)
[13-DEC-1893 to 16-OCT-1920] had died in childbirth,
so the household was my great grandmother, Grandpa (43) and
his older brother Irnie. Note, that had Ada not died, it's likely they
would not have needed domestic help 9 years later, and this narrative
would never have happened. Life.
</p>

<p>
Gradma began as a freshman at Willmington College in the fall of 1929.
In October, Grandpa drove there, picked her up and they went to Maysville,
KY and got married where the age of consent was lower. She was 19,
he was 43. Early letters to her sisters were signed "Mrs. George L.
Morrison", perhaps the custom of the time, but perhaps still seeking
something to call her own (identity, social status)
</p>

<p>
When I asked her about why they got married her answer was "It seemed
like the thing to do."  She was also afraid that she would not be able
to maintain her own high standards with college level work.  And one
alternative seemed to be returning home, which (inferring) was a
situation she desperately wanted out of.
</p>

<p>
Of course once married, she picked up where she left off with domestic
chores and caring for a mother-in-law who I infer was very proud in
her own ways and (guessing) maybe not thrilled with the marriage of
her son.
</p>

<p>
My great-grandmother had a cookbook/housekeeping guide that was
dedicated to "The Pert Housewives of 1876" and contained a section on
dealing with "the help" which consisted mostly in deriding "girls"
(sic) as flighty, un-reliable, a bad influence and lazy.  That was NOT
Grandma.  But it may have influenced her reception.
</p>

<p>
The story goes that one time Grandma was (obsessively I'm sure) cleaning
the basement stairs in a dirty dug-out cellar under the house that
was likely was impossible to keep clean, and my great grandmother
said "Pa would never let me do that". Ouch. Still no approval.
</p>
</div>
</div>
<div id="outline-container-orgc0e8dcc" class="outline-3">
<h3 id="orgc0e8dcc"><span class="section-number-3">1.4.</span> "In a Kingdom By The Sea&#x2026;"</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Poetry was a lifelong love. Philip (1933) was named Philip Lee, after
Poe's Anabell Lee. Mom (1936) was named Elaine, after Tennyson's "Elaine
the lovable, Elaine the fair, Elaine the lily maid of Astalot." You
could find solace in poetry, you could connect with worlds far away,
with noble thoughts, tragedies and triumphs, and you didn't need anyone's
approval.
</p>

<p>
She often recounted a story to me that someone once asked in an offhand
way "What is life?", to which she replied (with gleam in her eye) by
quoting (our "cousin Henry") Longfellow's "A Psalm of Life".
</p>

<blockquote>
<p>
Tell me not in mournful numbers,
'life is but an empty dream',
for the soul is dead that slumbers,
and things are not what they may seem,
</p>

<p>
Life is real, life is earnest,
and the grave is not it's goal,
dust thou art, to dust returneth,
'twas not spoken of the soul"
</p>

<p>
&#x2026;
</p>
</blockquote>

<p>
I've memorized that one too. She probably had hundreds memorized, at
least in part. I have a poetry book in which she marked her favorites:
"The Pert Chicken", "The Dash", "The Mighty Casey", "The Midnight Ride
of Paul Revere", "'Ya Gotta Get a Glory (in the work you do)"&#x2026;.
</p>
</div>
</div>
