2003=morrison=esther=free__biography.org
** Raising Kids in Hard Times
The great depression happened (the market crashed 2 weeks after their
wedding). WWII happened. Philip and Mom were born. My great
grandmother died.   At this point (and this is interpretation)
I think she /finally/ had a life she could in some sense call her own.
She was out of the crowded, poor conditions of her youth, she was now
"the woman of the house" with two young children to raise and some
status in the community/church.  4-H was a thing.  County Fairs were a
thing.  The Dry Run United Methodist Church and (my memory) the annual
chicken supper fund-raisers where a thing. If old school pictures are
any indication, Mom and Philip were dressed neatly, in cloths Grandma
likely made.  In later years, her button box was a fascinating source
of entertainment for young grandchildren.  Laurel now has the foot-pump
Singer sewing machine which once ran a needle through mom's finger.

Mom was born February 19, 1936 which weather records show was one of
the coldest on record. The day she was born, a glass of water on the
bed beside Grandma froze. No central heating. Just wood Grandpa cut.
Grandpa apparently also had the 19th century belief in the benefits
of fresh air and slept with the windows open in the winter. They sometimes
kept a heated iron under the covers. I still have some of their hand-made
quilts.

Philip and Mom were both (like Grandma) valedictorians at
Frankfort. More interpretation: I think she succumbed to the
temptation that many parents have to try, in some sense, to live
through their children.   In Grandma's case I think one form this took
was driving Mom, and Philip in particular, to excel and move towards
respected careers (that would reflect back on her): Mom got an
education degree, and Philip started down the path to becoming a
doctor.

** "I wonder how the old folks are at home..."
   "...I wonder if they'll miss me when I'm gone"

Philip went off to college (Bowling Green) in 1951.  Mom went to
the Ohio University extension in Chillicothe 54-57, then off to main
campus for her final year, where she met Dad and the rest is
history....

Irnie [1-OCT-1882 to 12-DEC-1954] died on the way home from church (on Mom's shoulder as
she drove). He left his portion of the farm "to George [Morrison] for
his lifetime, then to" Mom and Philip.

Mom came home from Newfoundland and had Mike in the hospital in
Chillicothe while Dad was stationed in Newfoundland or VA Beach.

In the early sixties they transitioned to being empty-nesters.  Philip
and Lilian settled in Long Island, Mom and Dad in Oxford (Miami U) and
then Worthington/Columbus.  There were visits from the growing young
families.  Mark was left in custody of Grandma once as we took a trip
west.

But Grandpa turned 80 in 1965, and the story goes that he could look
out across the fields and see the beautiful fall leaves, but Grandma
could only see the broken down picket fence.  Different people.
Literally, different outlooks.

She went with us on our ?1968? road trip to Newfoundland.  Salt cod.
salty, salty salt cod.

As a still-full-of-energy 55 year-old, the age difference was becoming
a problem. They sold the farm and moved to Worthington, first in an
apartment then at 369 Franklin Ct to be near us. I was able to ride
my bike over "the back way" and often did.

** Gee !!!, a second family.

Grandma could not sit still. She once again began baby-sitting for
extra money, and wound up with a long term job at the Gee's, essentially
raising a second family. Mike, Steve and Geoff Gee were almost exactly
our (Mike, George, Mark's) ages and at various times the 6 of us were
good friends. Eric Gee was born later. I think Geoff was in Mark's
wedding. Mike Gee was one of only about 20 people at Grandma's graveside
service, due to the February 2003 blizzard. Geoff wound up as professional
musician in the Boston area and dedicated one of his CDs to her. I
have a poetry anthology Steve gave her for Christmas one year. Mr Gee
was an attorney. They paid into social security for her, which enabled
her to draw it in later years.

Grandpa died in 1974 after a long battle with Parkinson's disease.
Mom and grandma cared for him in his last days at our house on Flint
Rd. and were completely exhausted afterwards. We took a road-trip to
California later that year to give them a break. Ironically, Grandma
hired Mrs. Todd, an older black lady, to care for Grandpa some of the
time she worked at the Gees.

The nest became un-empty twice. Beth Morrison (Denton) lived with her
while attending Ohio State 78-82, and I lived there for about a year
before our marriage in 87.

