2003=morrison=esther=free__biography.org
** 1990s and 90

She continued her lifelong calling of caring for others, doing somewhat
regular sitting for Steve Hill, the "differently-abled" (e.g. "retarded",
with no pejorative intent) son of an older couple in Worthington who,
themselves, needed a night out as a break. I recall her talking about
the Hills efforts to make arrangements for his care after they were
gone. Life.

I don't remember too many details, but one night when she was at 8080
Flint (sick?) she said she had a vision of an angel appear while
sleeping in the room that Grandpa had died in (Mark's room).
There may be an account of it in my archives.

In 2000 we had a large birthday party for her on her 90th birthday.
The entire family was there.

Mom and Dad retired, sold 8080 Flint Rd. and moved to McGregor
around 1996.
Grandma, then around 86, sold her house and moved in with them
in an apartment in the basement.   These are likely the years the
great grandchildren will remember.  There was an attempt at a sale,
but that's not how things were done in suburbia.  Much of the
left-over furniture got carted to Rosedale (home of Rosedale Bible
College where Daniel later attened) and may still be use.  When the
Realtor listed her house she put the line "Mrs. Clean Lives here."
Some of her money want to buy the McGregor house.

At McGregor, there were hours of reading together on the couch, of
watching Jeopardy!, and various shows/movies, playing games, cooking,
etc. She was active in the "Faithful Followers" group at Orange Road
Friends Church, where Mom and Dad had attended for 20+ years.

I do have Mom's narrative of her last days.

I had taken a job in Virginia.  I delayed going down a week because

I had taken a job in Virginia.  I delayed going down a week because
she had been in the hospital.  She died on February 14, 2023 13 days
after I went to Virgina.  I had to drive home into the face of a
blizard to get back, and got as far as Zanesville before it hit.  She
hated snow.

That morning, I had been having my quiet time and ended around 6, went
out in the hall to go down to my car, but felt the urgent need to go
back in and pray more.  I did so, and got a strong sense of God saying
"I'm here in Virgina with you too" (See the Psalms "Where can I go
from your presence...if I go the far side of the sea, you are
there...").  I got the call at work about 40 minutes later, and
realized that my unexplained need for more prayer happened at the time
she was dying.  To quote Neil Young "There's more to the picture, than
meets the eye..."

For the early part of her life, she had very little to call her own.
Part of her response was to work hard at the things she did to, I
think, try to prove herself.  That stuck with her much of her life.
So did resentments that started with her fathers absence at birth,
her mother's favoring of "the boys", and differences with Grandpa.

Mom said that, in the last week or two of her life, she seemed to find
a way to let it go and be at peace.  I need to re-read Mom's narrative of
that time.  I think we all carry more worries than we need to.

#+begin_quote
Just as I am, though tossed about
with many a conflict, many a doubt,
fightings and fears within, without,
O Lamb of God, I come, I come.
#+end_quote

P.S. I also have a copy of the autobiography she wrote for her
Grandchildren.   Lots of poetry.


* Timeline

TIMELINE
  |        WHEN | WHAT                                    | TYPE            | WHERE                           | WHO                              | HOW               |
  |-------------+-----------------------------------------+-----------------+---------------------------------+----------------------------------+-------------------|
  |        1910 | Born                                    | Life Event      | Near Jeffersonville, Ohio       | Russell E. and Belle Steele Free |                   |
  |        1929 | Valedictorian, Frankfort HS             | Education       | Frankfort, Ohio                 |                                  |                   |
  |        1929 | Housekeeping for Morrisons              | Financial       | Morrison Farm                   |                                  |                   |
  |        1929 | Freshman, Wilmington College            | Education       | Wilmington, Ohio                |                                  |                   |
  |        1929 | Married                                 | Life Event      | Maysville, Ky                   | George L. Morrison               |                   |
  |        1933 | Child Born                              | Life Event      | Farm. Union Twp, Ross Co., Ohio | Philip Lee Morrison              |                   |
  |        1936 | Child Born                              | Life Event      | Farm. Union Twp, Ross Co., Ohio | Lois Elaine Morrison             |                   |
  |      1950s? | Father dies                             | Life Event      |                                 | Russell E. Free                  |                   |
  |       1962? | Mother dies                             | Life Event      |                                 | Belle Steele Free                |                   |
  |        1968 | Sold Farm, bought house?                | Financial       | 369 Franklin Ct., Worthington   |                                  | Date per Philip   |
  |        1968 | Moves to Worthington                    | Move            | Apartment                       |                                  | Date rough memory |
  |  1960-1990s | Housekeeping, "Baby"sitting             | Financial       | Worthington                     |                                  |                   |
  | 1970s-1980s | Housekeeping, raised Gee boys , paid SS | Financial       | Worthington                     |                                  |                   |
  |       1996? | Sold House, Moved in with Mom,Dad       | Financial, Move | McGregor                        |                                  |                   |
  |        2003 | Died                                    | Life Event      | McGregor, Worthington, Ohio     |                                  | Old Age.  Stroke? |

* Writing Guidelines                                               :noexport:
** Writing style/guides
  - Keep it short (3000 words or less)
  - Use knowledge of finances loosely as writing prompts
  - Highlight reel - Triumphs, turning points, mistakes.  Not gory
    details.
  - Writing process
    + draft
    + sleep on it
    + revise
    + have friends and family review
      o what was most interesting?
      o what was boring or confusing?
      o what parts leave you wanting to know more?
      o what should be left out?


