2003=morrison=esther=free__biography.html
<div id="outline-container-org004e0d3" class="outline-3">
<h3 id="org004e0d3"><span class="section-number-3">1.8.</span> 1990s and 90</h3>
<div class="outline-text-3" id="text-1-8">
<p>
She continued her lifelong calling of caring for others, doing somewhat
regular sitting for Steve Hill, the "differently-abled" (e.g. "retarded",
with no pejorative intent) son of an older couple in Worthington who,
themselves, needed a night out as a break. I recall her talking about
the Hills efforts to make arrangements for his care after they were
gone. Life.
</p>

<p>
I don't remember too many details, but one night when she was at 8080
Flint (sick?) she said she had a vision of an angel appear while
sleeping in the room that Grandpa had died in (Mark's room).
There may be an account of it in my archives.
</p>

<p>
In 2000 we had a large birthday party for her on her 90th birthday.
The entire family was there.
</p>

<p>
Mom and Dad retired, sold 8080 Flint Rd. and moved to McGregor
around 1996.
Grandma, then around 86, sold her house and moved in with them
in an apartment in the basement.   These are likely the years the
great grandchildren will remember.  There was an attempt at a sale,
but that's not how things were done in suburbia.  Much of the
left-over furniture got carted to Rosedale (home of Rosedale Bible
College where Daniel later attened) and may still be use.  When the
Realtor listed her house she put the line "Mrs. Clean Lives here."
Some of her money want to buy the McGregor house.
</p>

<p>
At McGregor, there were hours of reading together on the couch, of
watching Jeopardy!, and various shows/movies, playing games, cooking,
etc. She was active in the "Faithful Followers" group at Orange Road
Friends Church, where Mom and Dad had attended for 20+ years.
</p>

<p>
I do have Mom's narrative of her last days.
</p>

<p>
I had taken a job in Virginia.  I delayed going down a week because
</p>

<p>
I had taken a job in Virginia.  I delayed going down a week because
she had been in the hospital.  She died on February 14, 2023 13 days
after I went to Virgina.  I had to drive home into the face of a
blizard to get back, and got as far as Zanesville before it hit.  She
hated snow.
</p>

<p>
That morning, I had been having my quiet time and ended around 6, went
out in the hall to go down to my car, but felt the urgent need to go
back in and pray more.  I did so, and got a strong sense of God saying
"I'm here in Virgina with you too" (See the Psalms "Where can I go
from your presence&#x2026;if I go the far side of the sea, you are
there&#x2026;").  I got the call at work about 40 minutes later, and
realized that my unexplained need for more prayer happened at the time
she was dying.  To quote Neil Young "There's more to the picture, than
meets the eye&#x2026;"
</p>

<p>
For the early part of her life, she had very little to call her own.
Part of her response was to work hard at the things she did to, I
think, try to prove herself.  That stuck with her much of her life.
So did resentments that started with her fathers absence at birth,
her mother's favoring of "the boys", and differences with Grandpa.
</p>

<p>
Mom said that, in the last week or two of her life, she seemed to find
a way to let it go and be at peace.  I need to re-read Mom's narrative of
that time.  I think we all carry more worries than we need to.
</p>

<blockquote>
<p>
Just as I am, though tossed about
with many a conflict, many a doubt,
fightings and fears within, without,
O Lamb of God, I come, I come.
</p>
</blockquote>

<p>
P.S. I also have a copy of the autobiography she wrote for her
Grandchildren.   Lots of poetry.
</p>
</div>
</div>
</div>
<div id="outline-container-org3a7909c" class="outline-2">
<h2 id="org3a7909c"><span class="section-number-2">2.</span> Timeline</h2>
<div class="outline-text-2" id="text-2">
<p>
TIMELINE
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">WHEN</th>
<th scope="col" class="org-left">WHAT</th>
<th scope="col" class="org-left">TYPE</th>
<th scope="col" class="org-left">WHERE</th>
<th scope="col" class="org-left">WHO</th>
<th scope="col" class="org-left">HOW</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1910</td>
<td class="org-left">Born</td>
<td class="org-left">Life Event</td>
<td class="org-left">Near Jeffersonville, Ohio</td>
<td class="org-left">Russell E. and Belle Steele Free</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">1929</td>
<td class="org-left">Valedictorian, Frankfort HS</td>
<td class="org-left">Education</td>
<td class="org-left">Frankfort, Ohio</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">1929</td>
<td class="org-left">Housekeeping for Morrisons</td>
<td class="org-left">Financial</td>
<td class="org-left">Morrison Farm</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">1929</td>
<td class="org-left">Freshman, Wilmington College</td>
<td class="org-left">Education</td>
<td class="org-left">Wilmington, Ohio</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">1929</td>
<td class="org-left">Married</td>
<td class="org-left">Life Event</td>
<td class="org-left">Maysville, Ky</td>
<td class="org-left">George L. Morrison</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">1933</td>
<td class="org-left">Child Born</td>
<td class="org-left">Life Event</td>
<td class="org-left">Farm. Union Twp, Ross Co., Ohio</td>
<td class="org-left">Philip Lee Morrison</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">1936</td>
<td class="org-left">Child Born</td>
<td class="org-left">Life Event</td>
<td class="org-left">Farm. Union Twp, Ross Co., Ohio</td>
<td class="org-left">Lois Elaine Morrison</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">1950s?</td>
<td class="org-left">Father dies</td>
<td class="org-left">Life Event</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Russell E. Free</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">1962?</td>
<td class="org-left">Mother dies</td>
<td class="org-left">Life Event</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Belle Steele Free</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">1968</td>
<td class="org-left">Sold Farm, bought house?</td>
<td class="org-left">Financial</td>
<td class="org-left">369 Franklin Ct., Worthington</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Date per Philip</td>
</tr>

<tr>
<td class="org-right">1968</td>
<td class="org-left">Moves to Worthington</td>
<td class="org-left">Move</td>
<td class="org-left">Apartment</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Date rough memory</td>
</tr>

<tr>
<td class="org-right">1960-1990s</td>
<td class="org-left">Housekeeping, "Baby"sitting</td>
<td class="org-left">Financial</td>
<td class="org-left">Worthington</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">1970s-1980s</td>
<td class="org-left">Housekeeping, raised Gee boys , paid SS</td>
<td class="org-left">Financial</td>
<td class="org-left">Worthington</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">1996?</td>
<td class="org-left">Sold House, Moved in with Mom,Dad</td>
<td class="org-left">Financial, Move</td>
<td class="org-left">McGregor</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">2003</td>
<td class="org-left">Died</td>
<td class="org-left">Life Event</td>
<td class="org-left">McGregor, Worthington, Ohio</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Old Age.  Stroke?</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</body>
</html>
